# Part 1. 판다스 입문

## 2. 판다스 자료구조

### 2-1. 시리즈

In [1]:
# pandas 불러오기 
import pandas as pd

In [2]:
# k:v 구조를 갖는 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data = {'a': 1, 'b': 2, 'c': 3}

In [6]:
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [8]:
type(dict_data)

dict

In [4]:
# 판다스 Series() 함수로 딕셔너리(dict_data)를 시리즈로 변환. 변수 sr에 저장 
sr = pd.Series(dict_data)

In [10]:
sr

a    1
b    2
c    3
dtype: int64

In [11]:
type(sr)

pandas.core.series.Series

In [ ]:
# 변수 sr의 자료형 출력
print(type(sr))

In [12]:
sr

a    1
b    2
c    3
dtype: int64

In [13]:
# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
list_data

['2019-01-02', 3.14, 'ABC', 100, True]

In [14]:
sr = pd.Series(list_data)
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [15]:
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [20]:
list(range(0, 10+1, 1))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [16]:
list(range(0, 10+1, 1))[::2]

[0, 2, 4, 6, 8, 10]

In [25]:
sr.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
sr.values

array(['2019-01-02', 3.14, 'ABC', 100, True], dtype=object)

In [29]:
# 인덱스 배열은 변수 idx에 저장. 데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values
print(idx)
print(val)

RangeIndex(start=0, stop=5, step=1)
['2019-01-02' 3.14 'ABC' 100 True]

In [31]:
# 인덱스 배열은 변수 idx에 저장. 데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values

In [32]:
idx

RangeIndex(start=0, stop=5, step=1)

In [33]:
val

array(['2019-01-02', 3.14, 'ABC', 100, True], dtype=object)

In [34]:
# 투플을 시리즈로 변환(index 옵션에 인덱스 이름을 지정)
tup_data = ('영인', '2010-05-01', '여', True)
tup_data

('영인', '2010-05-01', '여', True)

In [37]:
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
sr

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [44]:
sr[0:]

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [45]:
sr['이름':'성별']

이름              영인
생년월일    2010-05-01
성별               여
dtype: object

In [46]:
sr['생년월일']

'2010-05-01'

In [38]:
# 원소를 1개 선택
sr[0]       # sr의 1 번째 원소를 선택 (정수형 위치 인덱스를 활용)

'영인'

In [39]:
sr['성별']  # '이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용)

'여'

In [40]:
# 여러 개의 원소를 선택 (인덱스 리스트 활용)
sr[ [0, 3, 2] ]

이름        영인
학생여부    True
성별         여
dtype: object

In [41]:
sr[ ['생년월일', '성별', '이름'] ]

생년월일    2010-05-01
성별               여
이름              영인
dtype: object

In [42]:
# 여러 개의 원소를 선택 (인덱스 범위 지정)
sr[:]

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [43]:
sr['생년월일' : '학생여부']

생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

### 2-2. 데이터프레임

In [59]:
# 열이름을 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [60]:
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [61]:
# 판다스 DataFrame() 함수로 딕셔너리를 데이터프레임으로 변환. 변수 df에 저장. 
df = pd.DataFrame(dict_data)

In [62]:
df.columns

Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object')

In [63]:
# df의 자료형 출력
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [64]:
# 변수 df에 저장되어 있는 데이터프레임 객체를 출력
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [65]:
df.columns.name = 'temp'

In [66]:
df.columns

Index(['c0', 'c1', 'c2', 'c3', 'c4'], dtype='object', name='temp')

In [99]:
# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([ [15, '남', '덕영중'], 
                    [17, '여', '수리중']], 
                   index=['준서', '예은'],
                   columns=['나이', '성별', '학교'])
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [100]:
df#['학교']

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [101]:
df.index

Index(['준서', '예은'], dtype='object')

In [102]:
df.columns

Index(['나이', '성별', '학교'], dtype='object')

In [103]:
# 행 인덱스, 열 이름 변경하기
df.index = ['학생1', '학생2']

In [104]:
df.index

Index(['학생1', '학생2'], dtype='object')

In [106]:
df.columns = ['연령', '남녀', '소속']

In [107]:
df.columns

Index(['연령', '남녀', '소속'], dtype='object')

In [80]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [90]:
df['소속']#['학생1']

학생1    덕영중
학생2    수리중
Name: 소속, dtype: object

In [112]:
# 행 인덱스/열 이름 지정하여, 데이터프레임 만들기
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']], 
                   index=['준서', '예은'],
                   columns=['나이', '성별', '학교'])

In [113]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [116]:
df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'}, inplace=True)

In [117]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [118]:
df = df.rename(columns={'나이':'연령', '성별':'남녀', '학교':'소속'})

In [119]:
df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [120]:
# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1', '예은':'학생2' }, inplace=True)

In [121]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [122]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [123]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [124]:
# 데이터프레임 df를 복제하여 변수 df2에 저장. df2의 1개 행(row)을 삭제
df2 = df[:]
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [126]:
df2.drop('우현', inplace=True)

/var/folders/2w/p0zgpvps62gb8jlzgy_v7zgh0000gn/T/ipykernel_2702/1690762811.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현', inplace=True)

In [127]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [ ]:
df

In [128]:
# 데이터프레임 df를 복제하여 변수 df3에 저장. df3의 2개 행(row)을 삭제
df3 = df
df3.drop(['우현', '인아'], axis=0, inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [129]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [130]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [131]:
# 데이터프레임 df를 복제하여 변수 df4에 저장. df4의 1개 열(column)을 삭제
df4 = df.copy()
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df4.drop('수학', axis=1, inplace=True)
df4

In [132]:
# 데이터프레임 df를 복제하여 변수 df5에 저장. df5의 2개 열(column)을 삭제
df5 = df.copy()
df5.drop(['영어', '음악'], axis=1, inplace=True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

!!! 행 / 열 선택 (중요) !!!

In [161]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [162]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [163]:
df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [175]:
df.loc[ ['서준', '인아'] ].iloc[1][0:2]#['음악']

수학    70
영어    95
Name: 인아, dtype: int64

In [182]:
# 행 인덱스를 사용하여 행 1개를 선택
label1 = df.loc['서준':]    # loc 인덱서 활용
label1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [187]:
position1 = df.iloc[0:]     # iloc 인덱서 활용
position1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [188]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준', '인아']]
label2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [190]:
# position2 = df.loc[0]
# position2

In [195]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'우현']
# label3 = df.iloc[0:2]
label3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [196]:
position3 = df.iloc[0:1+1]
position3

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [200]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
# exam_data = pd.DataFrame({'이름' : [ '서준', '우현', '인아'],
#              '수학' : [ 90, 80, 70],
#              '영어' : [ 98, 89, 95],
#              '음악' : [ 85, 95, 100],
#              '체육' : [ 100, 90, 90]})
df = pd.DataFrame(exam_data)
df
# exam_data

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [201]:
df.iloc[ [0,2] ]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [202]:
# '수학' 점수 데이터만 선택. 변수 math1에 저장
math1 = df['수학']
print(type(math1))
math1

<class 'pandas.core.series.Series'>

0    90
1    80
2    70
Name: 수학, dtype: int64

In [207]:
# '영어' 점수 데이터만 선택. 변수 english에 저장
english = df['영어']
print(type(english))
english

<class 'pandas.core.series.Series'>

0    98
1    89
2    95
Name: 영어, dtype: int64

In [204]:
# '음악', '체육' 점수 데이터를 선택. 변수 music_gym 에 저장
music_gym = df[['음악', '체육']]
print(type(music_gym))
music_gym

<class 'pandas.core.frame.DataFrame'>

    음악   체육
0   85  100
1   95   90
2  100   90

In [205]:
# '수학' 점수 데이터만 선택. 변수 math2에 저장
math2 = df[ ['수학'] ]
print(type(math2))
math2

<class 'pandas.core.frame.DataFrame'>

   수학
0  90
1  80
2  70

In [225]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [226]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [210]:
df.index#.name = 'temp'

Index(['서준', '우현', '인아'], dtype='object', name='이름')

In [227]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [228]:
# 데이터프레임 df의 특정 원소 1개 선택 ('서준'의 '음악' 점수)
a = df.loc['서준', '음악']
a

85

In [229]:
b = df.iloc[0, 2]
print(b)

85

In [230]:
# 데이터프레임 df의 특정 원소 2개 이상 선택 ('서준'의 '음악', '체육' 점수) 
c = df.loc['서준', ['음악', '체육'] ]
print(c)

음악     85
체육    100
Name: 서준, dtype: int64

In [233]:
d = df.iloc[0, 2:4]
print(d)

음악     85
체육    100
Name: 서준, dtype: int64

In [234]:
e = df.loc['서준', '음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [236]:
f = df.iloc[0, [2, 3]]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [237]:
f = df.iloc[0, 2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [238]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수) 
g = df.loc[ ['서준', '우현'] , ['음악', '체육'] ]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [239]:
h = df.iloc[[0, 1], [2, 3]]
print(h)

    음악   체육
이름
서준  85  100
우현  95   90

In [240]:
i = df.loc['서준':'우현', '음악':'체육']
print(i)

    음악   체육
이름
서준  85  100
우현  95   90

In [241]:
j = df.iloc[0:2, 2:]
print(j)

    음악   체육
이름
서준  85  100
우현  95   90

### 열추가 : 예제 1-12

In [327]:
import pandas as pd

In [328]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [329]:
# 데이터프레임 df에 '국어' 점수 열(column)을 추가. 데이터 값은 80 지정
df['국어'] = 80
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [330]:
df['사회'] = [70, 80, 90]
df

   이름  수학  영어   음악   체육  국어  사회
0  서준  90  98   85  100  80  70
1  우현  80  89   95   90  80  80
2  인아  70  95  100   90  80  90

In [331]:
df['판다스'] = 100
df

   이름  수학  영어   음악   체육  국어  사회  판다스
0  서준  90  98   85  100  80  70  100
1  우현  80  89   95   90  80  80  100
2  인아  70  95  100   90  80  90  100

### 행추가 : 예제 1-13

In [332]:
# 새로운 행(row)을 추가 - 같은 원소 값을 입력
df.loc[3] = 0
df

   이름  수학  영어   음악   체육  국어  사회  판다스
0  서준  90  98   85  100  80  70  100
1  우현  80  89   95   90  80  80  100
2  인아  70  95  100   90  80  90  100
3   0   0   0    0    0   0   0    0

In [340]:
# 새로운 행(row)을 추가 - 원소 값 여러 개의 배열 입력
df.loc[10] = ['동규', 90, 80, 70, 60, 70, 100, 90]
df

    이름  수학  영어   음악   체육  국어   사회  판다스
0   서준  90  98   85  100  80   70  100
1   우현  80  89   95   90  80   80  100
2   인아  70  95  100   90  80   90  100
3    0   0   0    0    0   0    0    0
4   동규  90  80   70   60  70  100   90
행5   0   0   0    0    0   0    0    0
6   동규  90  80   70   60  70  100   90
9   동규  90  80   70   60  70  100   90
8   동규  90  80   70   60  70  100   90
10  동규  90  80   70   60  70  100   90

In [335]:
# 새로운 행(row)을 추가 - 기존 행을 복사
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육  국어   사회  판다스
0   서준  90  98   85  100  80   70  100
1   우현  80  89   95   90  80   80  100
2   인아  70  95  100   90  80   90  100
3    0   0   0    0    0   0    0    0
4   동규  90  80   70   60  70  100   90
행5   0   0   0    0    0   0    0    0

In [353]:
ndf = df.reset_index()
ndf

  index  이름  수학  영어   음악   체육  국어   사회  판다스
0     0  서준  90  98   85  100  80   70  100
1     1  우현  80  89   95   90  80   80  100
2     2  인아  70  95  100   90  80   90  100
3     3   0   0   0    0    0   0    0    0
4     4  동규  90  80   70   60  70  100   90
5    행5   0   0   0    0    0   0    0    0
6     6  동규  90  80   70   60  70  100   90
7     9  동규  90  80   70   60  70  100   90
8     8  동규  90  80   70   60  70  100   90
9    10  동규  90  80   70   60  70  100   90

### 원소값 변경 : 예제 1-14

In [291]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [292]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [293]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경사항 반영
df.set_index('이름', inplace=True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [294]:
df.iloc[0]#[3]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [295]:
df.iloc[0,3]

100

In [296]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0,3] = 80
df

    수학  영어   음악  체육
이름
서준  90  98   85  80
우현  80  89   95  90
인아  70  95  100  90

In [297]:
df.iloc[0][3]

80

In [298]:
df.iloc[0, 3]

80

In [300]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0][3] = 85
df

    수학  영어   음악  체육
이름
서준  90  98   85  85
우현  80  89   95  90
인아  70  95  100  90

In [301]:
df.loc['서준']['체육']

85

In [302]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [303]:
df.loc['서준', '체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [304]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법: '서준'의 '음악', '체육' 점수
df.loc['서준', ['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
서준  90  98   50  50
우현  80  89   95  90
인아  70  95  100  90

In [305]:
df.loc['서준', ['음악', '체육']] = [100, 50]
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

### 행, 열의 위치 바꾸기 : 예제 1-15

In [138]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [139]:
# 데이터프레임 df를 전치하기 (메소드 활용)
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90

In [140]:
# 데이터프레임 df를 다시 전치하기 (클래스 속성 활용)
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

## 3. 인덱스 활용

In [141]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장 
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [142]:
# 특정 열(column)을 데이터프레임의 행 인덱스(index)로 설정 
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [143]:
ndf.index

Index(['서준', '우현', '인아'], dtype='object', name='이름')

In [144]:
ndf2 = ndf.set_index('음악')
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [145]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [146]:
ndf3.index

MultiIndex([(90,  85),
            (80,  95),
            (70, 100)],
           names=['수학', '음악'])

In [243]:
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [148]:
# 인덱스를 [r0, r1, r2, r3, r4]로 재지정
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [149]:
# reindex로 발생한 NaN값을 숫자 0으로 채우기
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [150]:
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [151]:
# 행 인덱스를 정수형으로 초기화 
ndf = df.reset_index()
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [152]:
ndf.drop('index', axis=1)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [153]:
df.reset_index(drop=True)
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [154]:
# 딕셔서리를 정의
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

# 딕셔서리를 데이터프레임으로 변환. 인덱스를 [r0, r1, r2]로 지정
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [155]:
# 내림차순으로 행 인덱스 정렬 
ndf = df.sort_index(ascending=False)
ndf

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [157]:
ndf.sort_index(ascending=True)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

## 4. 시리즈 연산

In [354]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [355]:
# 학생의 과목별 점수를 100으로 나누기
percentage = student1 / 100
percentage

국어    1.0
영어    0.8
수학    0.9
dtype: float64

In [356]:
type(percentage)

pandas.core.series.Series

In [357]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student1

국어    100
영어     80
수학     90
dtype: int64

In [358]:
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
student2

수학    80
국어    90
영어    80
dtype: int64

In [359]:
student1 + student2

국어    190
수학    170
영어    160
dtype: int64

In [360]:
# 두 학생의 과목별 점수로 사칙연산 수행
addition = student1 + student2               #덧셈
subtraction = student1 - student2            #뺄셈
multiplication = student1 * student2         #곱셈
division = student1 / student2               #나눗셈

In [364]:
addition

국어    190
수학    170
영어    160
dtype: int64

In [362]:
subtraction

국어    10
수학    10
영어     0
dtype: int64

In [361]:
multiplication

국어    9000
수학    7200
영어    6400
dtype: int64

In [363]:
division

국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [365]:
type(division)

pandas.core.series.Series

In [366]:
[addition, subtraction, multiplication, division]

[국어    190
 수학    170
 영어    160
 dtype: int64,
 국어    10
 수학    10
 영어     0
 dtype: int64,
 국어    9000
 수학    7200
 영어    6400
 dtype: int64,
 국어    1.111111
 수학    1.125000
 영어    1.000000
 dtype: float64]

In [371]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [372]:
# 라이브러리 불러오기 
import pandas as pd
import numpy as np

In [373]:
np.nan

nan

In [374]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [375]:
student2 = pd.Series({'수학':80, '국어':90})
student2

수학    80
국어    90
dtype: int64

In [379]:
# 두 학생의 과목별 점수로 사칙연산 수행 (시리즈 vs. 시리즈)
addition = student1 + student2               #덧셈
subtraction = student1 - student2            #뺄셈
multiplication = student1 * student2         #곱셈
division = student1 / student2               #나눗셈

In [380]:
addition

국어      NaN
수학    170.0
영어      NaN
dtype: float64

In [381]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([addition, subtraction, multiplication, division], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학  영어
덧셈  NaN   170.000 NaN
뺄셈  NaN    10.000 NaN
곱셈  NaN  7200.000 NaN
나눗셈 NaN     1.125 NaN

In [382]:
# 딕셔너리 데이터로 판다스 시리즈 만들기
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [383]:
student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [384]:
student2

수학    80
국어    90
dtype: int64

In [385]:
# 두 학생의 과목별 점수로 사칙연산 수행 (연산 메소드 사용)
sr_add = student1.add(student2, fill_value=0)    #덧셈
sr_sub = student1.sub(student2, fill_value=0)    #뺄셈
sr_mul = student1.mul(student2, fill_value=0)    #곱셈
sr_div = student1.div(student2, fill_value=0)    #나눗셈

In [386]:
# 사칙연산 결과를 데이터프레임으로 합치기 (시리즈 -> 데이터프레임)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], 
                      index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

       국어        수학    영어
덧셈   90.0   170.000  80.0
뺄셈  -90.0    10.000  80.0
곱셈    0.0  7200.000   0.0
나눗셈   0.0     1.125   inf

In [387]:
result['국수합계'] = result['국어'] + result['수학']

In [388]:
result

       국어        수학    영어      국수합계
덧셈   90.0   170.000  80.0   260.000
뺄셈  -90.0    10.000  80.0   -80.000
곱셈    0.0  7200.000   0.0  7200.000
나눗셈   0.0     1.125   inf     1.125

In [415]:
# 라이브러리 불러오기
import pandas as pd
import seaborn as sns

In [416]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [417]:
titanic[ ['age','fare'] ]

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [429]:
df = titanic.loc[:, ['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [393]:
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [394]:
df.tail() # df.head()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [395]:
type(df)

pandas.core.frame.DataFrame

In [425]:
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [430]:
addtion = df.add(10)
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [428]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10
addition

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [397]:
addition['add'] = addition['age'] +  addition['fare']
addition['sub'] = addition['age'] -  addition['fare']
addition['mul'] = addition['age'] *  addition['fare']
addition['div'] = addition['age'] /  addition['fare']
addition

      age     fare       add      sub        mul       div
0    32.0  17.2500   49.2500  14.7500   552.0000  1.855072
1    48.0  81.2833  129.2833 -33.2833  3901.5984  0.590527
2    36.0  17.9250   53.9250  18.0750   645.3000  2.008368
3    45.0  63.1000  108.1000 -18.1000  2839.5000  0.713154
4    45.0  18.0500   63.0500  26.9500   812.2500  2.493075
..    ...      ...       ...      ...        ...       ...
886  37.0  23.0000   60.0000  14.0000   851.0000  1.608696
887  29.0  40.0000   69.0000 -11.0000  1160.0000  0.725000
888   NaN  33.4500       NaN      NaN        NaN       NaN
889  36.0  40.0000   76.0000  -4.0000  1440.0000  0.900000
890  42.0  17.7500   59.7500  24.2500   745.5000  2.366197

[891 rows x 6 columns]

In [439]:
test = df[['age']]
test = test['age'].fillna(0)
test.astype(int)

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888     0
889    26
890    32
Name: age, Length: 891, dtype: int64

In [403]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]

In [404]:
df.tail()

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [414]:
addition = df + 10
addition.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

In [419]:
# 데이터프레임에 숫자 10 더하기
addition = df.add(10, fill_value=0)
addition.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888  10.0  33.45
889  36.0  40.00
890  42.0  17.75

In [413]:
# 데이터프레임끼리 연산하기 (additon - df)
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

In [412]:
# 데이터프레임끼리 연산하기 (additon - df)
subtraction = addition.sub(df, fill_value=0)
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888  10.0  10.0
889  10.0  10.0
890  10.0  10.0